Config/Documents/РасчетНалогаНаПрибыль.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>РасчетНалогаНаПрибыль</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.ЖурналПроводокЕПСБУ</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КФО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КВД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлавныйБухгалтер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйИсполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДвиженияДокумента</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИФО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КФО</Name>
							<Type>
								<v8:Type>cfg:EnumRef.КВД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетДт</Name>
							<Type>
								<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодразделениеДт</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КПСДт</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КЭКДт</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоДт1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоДт2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоДт3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконто</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидНалога</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыНалоговИПлатежей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НалогСборПлатеж</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НалогиИПлатежиОрганизации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/Documents/РасчетНалогаНаПрибыль/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// См. УправлениеДоступом.ЗаполнитьНаборыЗначенийДоступа.
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
	
	// Логика ограничения:
	// Чтения:     Организация
	// Изменения:  Организация
	
	// Чтение, Изменение: набор №0.
	Строка = Таблица.Добавить();
	Строка.ЗначениеДоступа = Организация;
	
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	РеквизитыСчетаДт = Новый Структура("Счет, КПС, КЭК, Подразделение, Субконто1, Субконто2, Субконто3",
		"СчетДт", "КПСДт", "КЭКДт", "ПодразделениеДт", "СубконтоДт1", "СубконтоДт2", "СубконтоДт3");
	БухгалтерскийУчет.ПроверитьЗаполнениеСчетаИАналитики(РеквизитыСчетаДт,
		ЭтотОбъект, "ДвиженияДокумента", Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	СуммаДокумента = ДвиженияДокумента.Итог("Сумма");
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Инициализация дополнительных свойств для проведения документа
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Запись наборов записей
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	ПроведениеСервер.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
КонецПроцедуры

#КонецОбласти

#Область ЗаполнениеДокумента

Процедура ЗаполнитьДокумент() Экспорт
	
	Если Проведен Тогда
		Записать(РежимЗаписиДокумента.ОтменаПроведения);
	КонецЕсли;
	
	ДвиженияДокумента.Очистить();
	
	СтруктураПараметров = Новый Структура("Организация, Дата, КФО, ИФО", Организация, Дата, КФО, ИФО);
	ТаблицаРасчетыСБюджетомПоНалогуНаПрибыль = НалоговыйУчет.ПодготовитьТаблицуРасчетыСБюджетомПоНалогуНаПрибыль(СтруктураПараметров);
	
	Если НалоговыйУчетКлиентСервер.НачислениеНалогаНаПрибыльПоКЭК189(Дата) Тогда
		ТаблицаРасчетыСБюджетомПоНалогуНаПрибыль.Колонки.Добавить("КЭКДт", Новый ОписаниеТипов("СправочникСсылка.КОСГУ"));
		ТаблицаРасчетыСБюджетомПоНалогуНаПрибыль.ЗаполнитьЗначения(БухгалтерскийУчетПовтИсп.КЭКПоКоду("189"), "КЭКДт");
	КонецЕсли;
	
	ДвиженияДокумента.Загрузить(ТаблицаРасчетыСБюджетомПоНалогуНаПрибыль);
	
	Для Каждого СтрокаТаблицы Из ДвиженияДокумента Цикл
		СтрокаТаблицы.НалогСборПлатеж = Документы.РасчетНалогаНаПрибыль.НалогСборПлатежПоУмолчанию(Организация, СтрокаТаблицы.ВидНалога);
	КонецЦикла;
	
КонецПроцедуры

Процедура РаспределитьНалогПоДоходам() Экспорт
	
	Если Проведен Тогда
		Записать(РежимЗаписиДокумента.ОтменаПроведения);
	КонецЕсли;
	
	ТаблицаНалогНаПрибыль = ДвиженияДокумента.Выгрузить(,"ИФО,КФО,ВидНалога,НалогСборПлатеж,Сумма");
	ТаблицаНалогНаПрибыль.Свернуть("ИФО,КФО,ВидНалога,НалогСборПлатеж", "Сумма");
	
	СтруктураПараметров = Новый Структура("Организация, Дата, КФО, ИФО", Организация, Дата, КФО, ИФО);
	НалогНаПрибыльРаспределенный = НалоговыйУчет.РаспределитьНалогНаПрибыльПоДоходам(СтруктураПараметров, ТаблицаНалогНаПрибыль);
	
	ДвиженияДокумента.Загрузить(НалогНаПрибыльРаспределенный);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
